# SMTP and email services
## intro
* Protocols
  * Sending emails - SMTP
  * Opening emails - POP3, IMAP
* Cloud based email solutions are using HTTPS or similar technology
* DNS MX records can help us identify a mail server(s)
* Query information about MX records
  * host, dig
  * online solution: https://mxtoolbox.com/
<pre>
# Host - MX Records
mrFiSHER@htb[/htb]$ host -t MX hackthebox.eu
hackthebox.eu mail is handled by 1 aspmx.l.google.com.
mrFiSHER@htb[/htb]$ host -t MX microsoft.com
microsoft.com mail is handled by 10 microsoft-com.mail.protection.outlook.com.

# DIG - MX Records
mrFiSHER@htb[/htb]$ dig mx plaintext.do | grep "MX" | grep -v ";"
plaintext.do.           7076    IN      MX      50 mx3.zoho.com.
plaintext.do.           7076    IN      MX      10 mx.zoho.com.
plaintext.do.           7076    IN      MX      20 mx2.zoho.com.
mrFiSHER@htb[/htb]$ dig mx inlanefreight.com | grep "MX" | grep -v ";"
inlanefreight.com.      300     IN      MX      10 mail1.inlanefreight.com.

# Host - A Records
mrFiSHER@htb[/htb]$ host -t A mail1.inlanefreight.htb.
mail1.inlanefreight.htb has address 10.129.14.128

# examining results
- microsoft-com.mail.protection.outlook.com. (Cloud based - G-Suite)
- aspmx.l.google.com. (Cloud based - MS 365)
- mx.zoho.com. mx2.zoho.com. mx3.zoho.com. (Cloud based - Zoho)
- mail1.inlanefreight.com. (custom mail server - hosted by the company - OnSite)
</pre>
## common ports
<pre>
TCP/25	SMTP Unencrypted
TCP/143	IMAP4 Unencrypted
TCP/110	POP3 Unencrypted
TCP/465	SMTP Encrypted
TCP/587	SMTP Encrypted/STARTTLS
TCP/993	IMAP4 Encrypted
TCP/995	POP3 Encrypted
</pre>
## exploitation
* Email services use authentication to allow users to send emails and receive emails. A misconfiguration can happen when the SMTP service allows anonymous authentication or support protocols that can be used to enumerate valid usernames.
### username enumeration
* first try those that exists on every linux system for sure (like root, www-data, ...)
* commands to enumerate usernames
  * VRFY (check the validity of a particular email username)
    * it can be disabled by the mail server administrator
  * EXPN (similar to VRFY, except that can be used with distribution lists too)
    * when used on distribution list it will list all users on that list
    * try tipical names like 'all', 'support-team', 'dev', ...
  * RCPT (identifies the recipient of the email message)
    * after we define the sender (us), we can define multiple recipient
    * in other words we need to define the sender (us) once and then we can focus on bruteforcing the usernames with the RCPT command (and nothing else needed to be done)
#### VRFY
<pre>
# connect to SMTP mail server
mrFiSHER@htb[/htb]$ telnet 10.10.110.20 25
Trying 10.10.110.20...
Connected to 10.10.110.20.
Escape character is '^]'.
220 parrot ESMTP Postfix (Debian/GNU)

# check user 'root' - found
VRFY root
252 2.0.0 root

# check 'www-data' - found
VRFY www-data
252 2.0.0 www-data

# check random user - 'new-user' - not found
VRFY new-user
550 5.1.1 <new-user>: Recipient address rejected: User unknown in local recipient table
</pre>
#### EXPN
<pre>
# connect to SMTP mail server
mrFiSHER@htb[/htb]$ telnet 10.10.110.20 25
Trying 10.10.110.20...
Connected to 10.10.110.20.
Escape character is '^]'.
220 parrot ESMTP Postfix (Debian/GNU)

# check user 'john' - found
EXPN john
250 2.1.0 john@inlanefreight.htb

# check distribution list 'support-team' - found (and all users in the group will be listed)
EXPN support-team
250 2.0.0 carol@inlanefreight.htb
250 2.1.5 elisa@inlanefreight.htb
</pre>
#### RCPT
<pre>
# connect to SMTP mail server
mrFiSHER@htb[/htb]$ telnet 10.10.110.20 25
Trying 10.10.110.20...
Connected to 10.10.110.20.
Escape character is '^]'.
220 parrot ESMTP Postfix (Debian/GNU)

# define the email
MAIL FROM:test@htb.com
it is
250 2.1.0 test@htb.com... Sender ok


RCPT TO:julio

550 5.1.1 julio... User unknown


RCPT TO:kate

550 5.1.1 kate... User unknown


RCPT TO:john

250 2.1.5 john... Recipient ok
</pre>
